
GetPassphraseDescription = "Se necesita una contraseña para desbloquear la clave secreta para el usuario:  \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Se necesita una contraseña para desbloquear la clave secreta para el usuario:  %@\", ID %@, (main key ID %@)";
PassphraseLabel = "Contraseña:";




/* For Key-Status */
"Invalid" = "No válida";
"Revoked" = "Revocada";
"Expired" = "Expirada";
"Disabled" = "\nDeshabilitado";
"Unknown" = "Desconocido";
"Never" = "Never";
"Marginal" = "\nMarginal";
"Full" = "Completo";
"Ultimate" = "Máximo";


/* For Undo and Redo */
Undo_NewKey = "Nueva clave";
Undo_Delete = "Eliminar";
Undo_CleanKey = "Limpiar";
Undo_MinimizeKey = "Minimizar";
Undo_RevokeKey = "Revocar clave";
Undo_ChangeExpirationDate = "Cambiar la Fecha de Expiración";
Undo_ChangePassphrase = "Cambiar Contraseña";
Undo_AlgorithmPreferences = "Cambiar las Preferencias del Algoritmo";
Undo_Import = "Importar";
Undo_AddSignature = "Añadir Firma";
Undo_RemoveSignature = "Eliminar firma";
Undo_RevokeSignature = "Revocar Firma";
Undo_AddSubkey = "Añadir Subclave";
Undo_RemoveSubkey = "Eliminar Subclave";
Undo_RevokeSubkey = "Revocar Subclave";
Undo_AddUserID = "Añadir UserID";
Undo_RemoveUserID = "Eliminar UserID";
Undo_RevokeUserID = "Revocar UserID";
Undo_PrimaryUserID = "UserID primaria";
Undo_AddPhoto = "Añadir Foto";
Undo_RefreshFromServer = "Refrescar desde el servidor";
Undo_ReceiveFromServer = "Recibir desde el servidor";



/* Algorithm names */
CIPHER_ALGO_NONE = "Ninguno";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Ninguno";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algoritmo_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Firmado";
"Signature expired" = "Firma expirada";
"Key expired" = "Clave expirada";
"Bad signature" = "La firma y los datos no concuerdan. Esto podría significar que los datos han sido alterados.";
"Signature revoked" = "Firma revocada";
"Signature error" = "Error de firma";
"Unverifiable signature" = "La firma no se puede verificar.";
"Signed by stranger" = "La firma no se puede verificar, porque la clave pública correspondiente no se encuentra.";


/* Key Descriptions */
KeyDescriptionAndMore = "and %lu more";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Warning: Your key is about to expire";
KeyExpiryWarning_Msg = "Your key will expire on %1$@:\n\n%2$@\n\nExpired keys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this key.\n\nIf you choose to extend your key, it will be valid for two more years.\n\nDo you want to extend your key?";
KeyExpiryWarning_Yes = "Extend Key";
KeyExpiryWarning_No = "Cancel";
KeyExpiryWarning_Suppress = "Do Not Ask Again";

SubkeyExpiryWarning_Title = "Warning: Your subkey is about to expire";
SubkeyExpiryWarning_Msg = "Your subkey will expire on %1$@:\n\n%2$@\n\nExpired subkeys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this subkey.\n\nIf you choose to extend your subkey, it will be valid for two more years.\n\nDo you want to extend your subkey?";
SubkeyExpiryWarning_Yes = "Extend Subkey";
SubkeyExpiryWarning_No = "Cancel";
SubkeyExpiryWarning_Suppress = "Do Not Ask Again";

WrongPasswordTryAgain_Title = "You entered the wrong password";
WrongPasswordTryAgain_Msg = "Do you want to try it again?";
WrongPasswordTryAgain_Yes = "Try Again";
WrongPasswordTryAgain_No = "Cancel";

KeyExpiryFailed_Title = "Failed to extend your key!";
KeyExpiryFailed_Msg = "The key\n%1$@\ncould not be extened.\n\nError: %2$@";

KeyExtendedWantToUpload_Title = "Your key was extended successfully";
KeyExtendedWantToUpload_Msg = "In order for others to be able to see the new expiration date, it is necessary for them to import your updated key. Therefore it is recommended to upload your updated public key to the key servers.\n\nWarning: Key servers are public, so the name and email you use in your key will be publicly visible. Keys can not be deleted from the key servers. They can be revoked but not removed.\n\nIf you rather prefer not to use key servers, please consider attaching your public key to your signed and encrypted emails.\n\nDo you want to upload your public key?";
KeyExtendedWantToUpload_Yes = "Upload Public Key";
KeyExtendedWantToUpload_No = "No, Thanks!";

UploadFailed_Title = "Failed to upload the key!";
UploadFailed_Msg = "The key could not be uploaded to the keyserver.\n\nError: %@";


UpdaterNotWorking_Title = "¡El actualizador GPG Suite no funciona como se esperaba!";
UpdaterNotWorking_Msg = "Por favor, descargue y vuelva a instalar GPG Suite desde https://gpgtools.org";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "Cancel";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


